# ColorSelectionDialog Class

---
Allows display of the Revit Color dialog.
SystemObject Autodesk.Revit.UIColorSelectionDialog
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ColorSelectionDialog : IDisposable

    Public Class ColorSelectionDialog
    	Implements IDisposable

    public ref class ColorSelectionDialog : IDisposable

    type ColorSelectionDialog =
        class
            interface IDisposable
        end
The ColorSelectionDialog type exposes the following members.
| Name| Description
---|---|---
| ColorSelectionDialog|  Default constructor.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalColor|  The original color.
| SelectedColor|  The new color selected by the user.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ColorSelectionDialog
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Show|  Shows the Revit Color dialog as a modal dialog.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
The class provides the option to launch the Revit Color dialog to select the color.
#### Reference
Autodesk.Revit.UI Namespace